<?php
class SlugifyClass
{
  static function Slugify($name)
  {
    $gost = array(
      "Є" => "EH", "І" => "I", "і" => "i", "№" => "#", "є" => "eh",
      "А" => "A", "Б" => "B", "В" => "V", "Г" => "G", "Д" => "D",
      "Е" => "E", "Ё" => "JO", "Ж" => "ZH",
      "З" => "Z", "И" => "I", "Й" => "JJ", "К" => "K", "Л" => "L",
      "М" => "M", "Н" => "N", "О" => "O", "П" => "P", "Р" => "R",
      "С" => "S", "Т" => "T", "У" => "U", "Ф" => "F", "Х" => "KH",
      "Ц" => "C", "Ч" => "CH", "Ш" => "SH", "Щ" => "SHH", "Ъ" => "'",
      "Ы" => "Y", "Ь" => "", "Э" => "EH", "Ю" => "YU", "Я" => "YA",
      "а" => "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d",
      "е" => "e", "ё" => "jo", "ж" => "zh",
      "з" => "z", "и" => "i", "й" => "jj", "к" => "k", "л" => "l",
      "м" => "m", "н" => "n", "о" => "o", "п" => "p", "р" => "r",
      "с" => "s", "т" => "t", "у" => "u", "ф" => "f", "х" => "kh",
      "ц" => "c", "ч" => "ch", "ш" => "sh", "щ" => "shh", "ъ" => "",
      "ы" => "y", "ь" => "", "э" => "eh", "ю" => "yu", "я" => "ya", "«" => "", "»" => "", "—" => "-", " " => "-"
    );

    $iso = array(
      "Є" => "YE", "І" => "I", "Ѓ" => "G", "і" => "i", "№" => "#", "є" => "ye", "ѓ" => "g",
      "А" => "A", "Б" => "B", "В" => "V", "Г" => "G", "Д" => "D",
      "Е" => "E", "Ё" => "YO", "Ж" => "ZH",
      "З" => "Z", "И" => "I", "Й" => "J", "К" => "K", "Л" => "L",
      "М" => "M", "Н" => "N", "О" => "O", "П" => "P", "Р" => "R",
      "С" => "S", "Т" => "T", "У" => "U", "Ф" => "F", "Х" => "X",
      "Ц" => "C", "Ч" => "CH", "Ш" => "SH", "Щ" => "SHH", "Ъ" => "'",
      "Ы" => "Y", "Ь" => "", "Э" => "E", "Ю" => "YU", "Я" => "YA",
      "а" => "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d",
      "е" => "e", "ё" => "yo", "ж" => "zh",
      "з" => "z", "и" => "i", "й" => "j", "к" => "k", "л" => "l",
      "м" => "m", "н" => "n", "о" => "o", "п" => "p", "р" => "r",
      "с" => "s", "т" => "t", "у" => "u", "ф" => "f", "х" => "x",
      "ц" => "c", "ч" => "ch", "ш" => "sh", "щ" => "shh", "ъ" => "",
      "ы" => "y", "ь" => "", "э" => "e", "ю" => "yu", "я" => "ya", "«" => "", "»" => "", "—" => "-", " " => "-"
    );

    $rtl_standard = sfConfig::get('rtl_standard', 'iso');

    //to lower case
    $name = mb_strtolower($name, 'UTF-8');


    switch ($rtl_standard)
    {
      case 'off':
        $slug = $name;
        break;
      case 'gost':
        $slug = trim(strtr($name, $gost), '-');
        break;
      default:
        $slug = trim(strtr($name, $iso), '-');
        break;
    }

    //trash non alfabet characters
    preg_match_all('/[a-z0-9_\-]+/', $slug, $matches);
    if (isSet($matches[0]))
    {
      $slug = implode('', $matches[0]);
    }

    return $slug;
  }
}

?>
